balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/18xxxx/PIC18LF25K50.PIC
<?xml version="1.0" encoding="UTF-8" standalone="no" ?><edc:PIC xmlns:edc="http://crownking/edc" edc:arch="18xxxx" edc:desc="" edc:dosid="01548" edc:dsid="" edc:informedby="DOS" edc:isextended="true" edc:masksetid="LECG" edc:name="PIC18LF25K50" edc:psid="" edc:procid="0xd552" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Import>
    <edc:Module_import edc:modsrc="DOS-00567_cpu_pic18f_core_v2.Module"/>
    <edc:Module_import edc:modsrc="DOS-01548_tmr_timer0_v1_8bit.Module"/>
    <edc:Module_import edc:modsrc="DOS-00757_usb_fscore_v2.Module"/>
    <edc:Module_import edc:modsrc="DOS-00757_usb_fscore_v2_pic18f.Module"/>
    <edc:Module_import edc:modsrc="DOS-00834_afe_ctmu_con_v1_8bit.Module"/>
    <edc:Module_import edc:modsrc="DOS-01548_eccp_v1_8Bit.Module"/>
    <edc:Module_import edc:modsrc="DOS-01548_uart_enh_v3_8Bit.Module"/>
    <edc:Module_import edc:modsrc="DOS-01215_mssp_v5_pic18f.Module"/>
    <edc:Module_import edc:modsrc="DOS-00960_tmr_timer1_v3_8bit.Module"/>
    <edc:Module_import edc:modsrc="DOS-01548_tmr_timer2_v2_8bit.Module"/>
    <edc:Module_import edc:modsrc="DOS-01548_ccp_v1_8Bit.Module"/>
    <edc:Module_import edc:modsrc="DOS-00670_adc_sarcore_10bit_v1_8bit.Module"/>
    <edc:Module_import edc:modsrc="DOS-01548_cmp_control_v1_8Bit.Module"/>
    <edc:Module_import edc:modsrc="DOS-01548_pfm_control_v7_8bit.Module"/>
    <edc:Module_import edc:modsrc="DOS-00383_int_on_change_v1_8Bit.Module"/>
    <edc:Module_import edc:modsrc="DOS-00382_int_intp18f_v1_8bit.Module"/>
    <edc:Module_import edc:modsrc="DOS-01544_osc_int16m_ctrl_v1_8Bit.Module"/>
    <edc:Module_import edc:modsrc="DOS-01548_rst_integration_v6_8bit.Module"/>
    <edc:Module_import edc:modsrc="DOS-00943_lvd_ctrl_v3_8bit.Module"/>
    <edc:Module_import edc:modsrc="DOS-01548_PIC18F45K50.Module"/>
  </edc:Import>
  <edc:Power>
    <edc:VPP edc:defaultvoltage="8.500" edc:maxvoltage="9.000" edc:minvoltage="8.000"/>
    <edc:VDD edc:maxdefaultvoltage="3.600" edc:maxvoltage="3.600" edc:mindefaultvoltage="2.700" edc:minvoltage="1.800" edc:nominalvoltage="3.300"/>
  </edc:Power>
  <edc:Programming edc:haschecksum="true" edc:lvpthresh="2.700" edc:memtech="ee" edc:panelsize="0x0" edc:tries="1">
    <edc:Wait edc:cfg="5000" edc:eedata="4000" edc:erase="15000" edc:lverase="1000" edc:lvpgm="1000" edc:pgm="1000" edc:userid="5000"/>
    <edc:Latches edc:cfg="2" edc:eedata="2" edc:pgm="64" edc:rowerase="64" edc:userid="8"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="18xxxx" edc:name="18xxxx">
    <edc:MemTraits edc:bankcount="16" edc:hwstackdepth="31">
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:UserIDMemTraits edc:locsize="0x1" edc:wordimpl="0xf" edc:wordinit="0xff" edc:wordsafe="0xf" edc:wordsize="0x1"/>
      <edc:ConfigFuseMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:ConfigWORMMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:DeviceIDMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:EEDataMemTraits edc:magicoffset="0xf00000"/>
      <edc:DataMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0x0" edc:wordsafe="0xff" edc:wordsize="0x1"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:Oscillator>
    <edc:OscillatorMode edc:id="0" edc:max="48000000" edc:min="4000000"/>
    <edc:OscillatorMode edc:id="1" edc:max="25000000" edc:min="4000000"/>
    <edc:OscillatorMode edc:id="6" edc:max="48000000" edc:min="32000"/>
    <edc:OscillatorMode edc:id="7" edc:max="48000000" edc:min="32000"/>
    <edc:OscillatorMode edc:id="8" edc:max="48000000" edc:min="32000"/>
    <edc:OscillatorMode edc:id="9" edc:max="48000000" edc:min="32000"/>
    <edc:OscillatorMode edc:id="10" edc:max="4000000" edc:min="100000"/>
    <edc:OscillatorMode edc:id="11" edc:max="4000000" edc:min="100000"/>
  </edc:Oscillator>
  <edc:WatchdogTimer edc:min="4"/>
  <edc:Breakpoints edc:debugmoduletype="ICD_v2" edc:hasdatacapture="false" edc:hwbpcount="0x3" edc:idbyte="p"/>
  <edc:ProgramSpace>
    <edc:CodeSector edc:beginaddr="0x0" edc:endaddr="0x8000" edc:regionid="page"/>
    <edc:TestZone edc:beginaddr="0x200000" edc:endaddr="0x200480" edc:regionid="testmem"/>
    <edc:UserIDSector edc:beginaddr="0x200000" edc:endaddr="0x200008" edc:regionid="idlocs"/>
    <edc:ConfigFuseSector edc:beginaddr="0x300000" edc:endaddr="0x30000e" edc:regionid="config">
      <edc:DCRDef edc:access="--nnn-nn" edc:cname="CONFIG1L" edc:default="0x00" edc:desc="" edc:impl="0x3b" edc:name="CONFIG1L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x3b">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="PLLSEL" edc:desc="PLL Selection" edc:mask="0x1" edc:name="PLLSEL" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="PLL3X" edc:desc="3x clock multiplier" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PLL4X" edc:desc="4x clock multiplier" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CFGPLLEN" edc:desc="PLL Enable Configuration bit" edc:mask="0x1" edc:name="CFGPLLEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PLL Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PLL Disabled (firmware controlled)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="CPUDIV" edc:desc="CPU System Clock Postscaler" edc:mask="0x3" edc:name="CPUDIV" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="CLKDIV6" edc:desc="CPU uses system clock divided by 6" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="CLKDIV3" edc:desc="CPU uses system clock divided by 3" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="CLKDIV2" edc:desc="CPU uses system clock divided by 2" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="NOCLKDIV" edc:desc="CPU uses system clock (no divide)" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LS48MHZ" edc:desc="Low Speed USB mode with 48 MHz system clock" edc:mask="0x1" edc:name="LS48MHZ" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="SYS48X8" edc:desc="System clock at 48 MHz, USB clock divider is set to 8" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="SYS24X4" edc:desc="System clock at 24 MHz, USB clock divider is set to 4" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnn-nnnn" edc:cname="CONFIG1H" edc:default="0x25" edc:desc="" edc:impl="0xef" edc:name="CONFIG1H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xef">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FOSC" edc:desc="Oscillator Selection" edc:mask="0xf" edc:name="FOSC" edc:nzwidth="4">
              <edc:DCRFieldSemantic edc:cname="ECLIO" edc:desc="EC oscillator, low power &lt;4MHz" edc:when="(field &amp; 0xf) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="ECLCLKO" edc:desc="EC oscillator, low power &lt;4MHz, clock output on OSC2" edc:when="(field &amp; 0xf) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="ECMIO" edc:desc="EC oscillator, medium power 4MHz to 16MHz" edc:when="(field &amp; 0xf) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="ECMCLKO" edc:desc="EC oscillator, medium power 4MHz to 16MHz, clock output on OSC2" edc:when="(field &amp; 0xf) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="ECHIO" edc:desc="EC oscillator, high power 16MHz to 48MHz" edc:when="(field &amp; 0xf) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="ECHCLKO" edc:desc="EC oscillator, high power 16MHz to 48MHz, clock output on OSC2" edc:when="(field &amp; 0xf) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="RCIO" edc:desc="External RC oscillator" edc:when="(field &amp; 0xf) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="RCCLKO" edc:desc="External RC oscillator, clock output on OSC2" edc:when="(field &amp; 0xf) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="INTOSCIO" edc:desc="Internal oscillator" edc:when="(field &amp; 0xf) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="INTOSCCLKO" edc:desc="Internal oscillator, clock output on OSC2" edc:when="(field &amp; 0xf) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="HSM" edc:desc="HS oscillator, medium power 4MHz to 16MHz" edc:when="(field &amp; 0xf) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="HSH" edc:desc="HS oscillator, high power 16MHz to 25MHz" edc:when="(field &amp; 0xf) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT oscillator" edc:when="(field &amp; 0xf) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LP" edc:desc="LP oscillator" edc:when="(field &amp; 0xf) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="PCLKEN" edc:desc="Primary Oscillator Shutdown" edc:mask="0x1" edc:name="PCLKEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Primary oscillator enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Primary oscillator shutdown firmware controlled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FCMEN" edc:desc="Fail-Safe Clock Monitor" edc:mask="0x1" edc:name="FCMEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Fail-Safe Clock Monitor enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Fail-Safe Clock Monitor disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IESO" edc:desc="Internal/External Oscillator Switchover" edc:mask="0x1" edc:name="IESO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Oscillator Switchover mode enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Oscillator Switchover mode disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
